app/controllers/reports_controller.rb

SELECT * FROM "reports" LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "reports"
---
  def index
    @locations=Location.find(:all)
    @categories=Category.find(:all)
    @title="Reports"
    @filter=FilterCondition.new(params[:filtercondition]||={})
    if(@filter.condition.length==0)
      @reports= Report.paginate(:page=>params[:page],:per_page=>10,:order=>'created_at DESC')

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('forest fire', '2010-08-16 16:52:24', '2010-08-16 16:52:24')
INSERT INTO "locations" ("name", "created_at", "updated_at") VALUES('nagarhole', '2010-08-16 16:52:24', '2010-08-16 16:52:24')
INSERT INTO "reports" ("created_at", "title", "updated_at", "category_id", "location_id", "incident_date", "description") VALUES('2010-08-16 16:52:24', 'some title', '2010-08-16 16:52:24', 1, 1, '2010-08-16', 'description')
INSERT INTO "users" ("name", "encrypted_password", "created_at", "updated_at", "remember_token", "email") VALUES('praveen', 'password', '2010-08-16 16:52:24', '2010-08-16 16:52:24', NULL, 'a@a.com')
INSERT INTO "incident_images" ("image_file_name", "created_at", "image_file_size", "updated_at", "image_content_type", "report_id", "image_updated_at") VALUES('button.png', '2010-08-17 13:10:58', 2316, '2010-08-17 13:10:58', 'image/png', 1, '2010-08-17 13:10:58')
---
  def create
    @report=Report.new(params[:report])
    @report.category=Category.find(params[:report][:category_id])
    @report.location=Location.find(params[:report][:location_id])
    @title="Report Incident"
    @report.user=current_user
    if @report.save
      if params[:photos] != nil
        params[:photos].each do |key,photo|
          @image=IncidentImage.new(:image=>photo,:report=>@report)
          @image.save

SELECT * FROM "reports" WHERE ("reports"."id" = 1)
---
  def show
    @report=Report.find(params[:id])