app/controllers/users_controller.rb

INSERT INTO "users" ("name", "encrypted_password", "created_at", "updated_at", "remember_token", "email") VALUES('praveen', 'password', '2010-08-09 02:19:13', '2010-08-09 02:19:13', NULL, 'a@a.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
    @title="Edit User"
    @user=User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "email" = 'new@example.com', "name" = 'new name', "updated_at" = '2010-07-15 20:12:13', "encrypted_password" = 'something' WHERE "id" = 1
---
  def update
    @user=User.find(params[:id])
    if @user.update_attributes(params[:user])